[
  {
    "sku": "RBX-IND-1000",
    "product_name": "PrecisionArm 6-Axis",
    "category": "Industrial Robots",
    "description": "The PrecisionArm 6-Axis robot delivers best-in-class repeatability of ±0.02mm and a maximum payload of 16kg, making it ideal for high-precision assembly, automated inspection, and complex material handling tasks. With an innovative torque-sensing system across all joints and advanced collision detection, this collaborative robot seamlessly integrates into existing production lines while maintaining ISO/TS 15066 safety standards. Its intuitive teach pendant interface and pre-configured motion planning algorithms reduce programming time by up to 60%, enabling rapid deployment across automotive, electronics, and precision manufacturing applications.",
    "msrp": 37787,
    "cost": 22672,
    "margin": 15115,
    "margin_pct": 40.0,
    "weight_kg": 33.16,
    "payload_capacity": "71 kg",
    "reach_mm": "1286 mm",
    "color_options": "Industrial Gray/Safety Yellow",
    "configurations_available": "Standard/Heavy Duty",
    "inventory_on_hand": 14,
    "inventory_location": "Minneapolis",
    "reorder_point": 10,
    "supplier": "Servo Systems Inc",
    "lead_time_days": 87,
    "status": "Active",
    "release_date": "2021-11-30",
    "warranty_years": 2
  },
  {
    "sku": "RBX-IND-1001",
    "product_name": "HeavyDuty Articulated Robot",
    "category": "Industrial Robots",
    "description": "The HeavyDuty Articulated Robot delivers best-in-class payload capacity of up to 350kg with an exceptional reach of 3.2m, while maintaining positioning repeatability of ±0.05mm across its entire work envelope. Featuring advanced servo motors with integrated force-torque sensing and our proprietary SafeMove2 technology, this 6-axis powerhouse seamlessly handles demanding applications from heavy automotive assembly to large-scale material handling, all while enabling safe human-robot collaboration when needed. The robot's IP67-rated construction and modular joint design ensure reliable performance in harsh industrial environments while minimizing maintenance downtime.",
    "msrp": 48154,
    "cost": 28892,
    "margin": 19262,
    "margin_pct": 40.0,
    "weight_kg": 48.68,
    "payload_capacity": "8 kg",
    "reach_mm": "673 mm",
    "color_options": "Industrial Gray/Safety Yellow",
    "configurations_available": "Standard Only",
    "inventory_on_hand": 31,
    "inventory_location": "Portland",
    "reorder_point": 10,
    "supplier": "Servo Systems Inc",
    "lead_time_days": 35,
    "status": "Active",
    "release_date": "2020-12-23",
    "warranty_years": 2
  },
  {
    "sku": "RBX-IND-1002",
    "product_name": "HighSpeed Assembly Robot",
    "category": "Industrial Robots",
    "description": "The HighSpeed Assembly Robot combines precision 6-axis kinematics with advanced machine vision to achieve industry-leading cycle times of up to 120 picks per minute while maintaining ±0.02mm repeatability. Purpose-built for electronics and small parts assembly, this collaborative robot features an integrated force-torque sensor, tool-free gripper changes, and our proprietary SafeZone monitoring system that allows seamless human-robot interaction without compromising on speed. The compact 850mm reach and 7kg payload capacity make it ideal for high-mix production environments where rapid changeovers and consistent quality are essential.",
    "msrp": 42622,
    "cost": 25573,
    "margin": 17049,
    "margin_pct": 40.0,
    "weight_kg": 127.1,
    "payload_capacity": "53 kg",
    "reach_mm": "1549 mm",
    "color_options": "Industrial Gray/Safety Yellow",
    "configurations_available": "Single/Dual Arm",
    "inventory_on_hand": 15,
    "inventory_location": "Portland",
    "reorder_point": 10,
    "supplier": "Global Automation Components",
    "lead_time_days": 87,
    "status": "Active",
    "release_date": "2023-12-12",
    "warranty_years": 2
  },
  {
    "sku": "RBX-IND-1003",
    "product_name": "Welding Robot Pro",
    "category": "Industrial Robots",
    "description": "The Welding Robot Pro combines advanced 6-axis kinematics with AI-powered seam tracking to deliver precise, repeatable welds across multiple processes including MIG, TIG, and spot welding. Featuring a 210kg payload capacity, IP67-rated armor, and integrated collision detection, this collaborative robot maintains exceptional +/-0.03mm accuracy even in harsh manufacturing environments while its intuitive teach pendant interface reduces programming time by up to 60%. Perfect for automotive assembly, heavy equipment fabrication, and high-volume production lines requiring consistent, high-quality welds.",
    "msrp": 29253,
    "cost": 17551,
    "margin": 11702,
    "margin_pct": 40.0,
    "weight_kg": 89.19,
    "payload_capacity": "10 kg",
    "reach_mm": "1145 mm",
    "color_options": "Industrial Gray/Safety Yellow",
    "configurations_available": "Standard/Extended Reach",
    "inventory_on_hand": 36,
    "inventory_location": "Minneapolis",
    "reorder_point": 10,
    "supplier": "Vision Tech Ltd",
    "lead_time_days": 42,
    "status": "Active",
    "release_date": "2024-12-02",
    "warranty_years": 2
  },
  {
    "sku": "RBX-COL-1004",
    "product_name": "CoBot Assistant 5kg",
    "category": "Collaborative Robots",
    "description": "The CoBot Assistant 5kg is a state-of-the-art collaborative robot featuring advanced force-torque sensing and a intuitive teach pendant interface, enabling seamless human-robot interaction while maintaining ISO/TS 15066 safety compliance. With its 5kg payload capacity, ±0.02mm repeatability, and integrated vision system, this versatile cobot excels in precision assembly, quality inspection, and machine tending applications across electronics manufacturing and medical device production. The CoBot Assistant's quick setup programming and compact 850mm reach make it ideal for space-constrained production environments seeking to automate repetitive tasks while maintaining workforce flexibility.",
    "msrp": 32449,
    "cost": 19469,
    "margin": 12980,
    "margin_pct": 40.0,
    "weight_kg": 84.72,
    "payload_capacity": "67 kg",
    "reach_mm": "649 mm",
    "color_options": "Industrial Gray/Safety Yellow",
    "configurations_available": "Standard/Heavy Duty",
    "inventory_on_hand": 12,
    "inventory_location": "Portland",
    "reorder_point": 10,
    "supplier": "Global Automation Components",
    "lead_time_days": 76,
    "status": "Active",
    "release_date": "2021-01-04",
    "warranty_years": 2
  },
  {
    "sku": "RBX-COL-1005",
    "product_name": "CoBot Precision 10kg",
    "category": "Collaborative Robots",
    "description": "The CoBot Precision 10kg is a state-of-the-art collaborative robot featuring advanced force-torque sensing and a repeatability of ±0.02mm, enabling seamless human-robot interaction while maintaining exceptional accuracy for demanding applications. With its 10kg payload capacity and integrated safety systems including dynamic force monitoring, this 6-axis cobot excels in precision assembly, quality inspection, and machine tending tasks across electronics and automotive manufacturing. The system's intuitive teach pendant interface and pre-configured motion templates allow for rapid deployment, while its ISO/TS 15066-compliant design ensures safe operation alongside human workers without the need for safety fencing.",
    "msrp": 25173,
    "cost": 15103,
    "margin": 10070,
    "margin_pct": 40.0,
    "weight_kg": 34.19,
    "payload_capacity": "86 kg",
    "reach_mm": "1010 mm",
    "color_options": "Industrial Gray/Safety Yellow",
    "configurations_available": "Standard Only",
    "inventory_on_hand": 14,
    "inventory_location": "Minneapolis",
    "reorder_point": 10,
    "supplier": "Servo Systems Inc",
    "lead_time_days": 40,
    "status": "Active",
    "release_date": "2024-10-18",
    "warranty_years": 2
  },
  {
    "sku": "RBX-COL-1006",
    "product_name": "CoBot Mobile Platform",
    "category": "Collaborative Robots",
    "description": "The CoBot Mobile Platform is an advanced collaborative robotic system combining autonomous navigation with a 6-axis manipulator arm, enabling flexible material handling and precision tasks across dynamic manufacturing environments. Featuring industry-leading safety sensors, a payload capacity of 15kg, and seamless integration with existing automation systems through its open API architecture, this mobile cobot can be rapidly deployed for applications ranging from pick-and-place operations to machine tending. Its intuitive teach pendant programming and built-in collision avoidance make it ideal for manufacturers seeking to automate repetitive tasks while maintaining worker collaboration in shared workspaces.",
    "msrp": 20074,
    "cost": 12044,
    "margin": 8030,
    "margin_pct": 40.0,
    "weight_kg": 68.51,
    "payload_capacity": "18 kg",
    "reach_mm": "1515 mm",
    "color_options": "Industrial Gray/Safety Yellow",
    "configurations_available": "Standard/Extended Reach",
    "inventory_on_hand": 18,
    "inventory_location": "Portland",
    "reorder_point": 10,
    "supplier": "Robotix Manufacturing",
    "lead_time_days": 70,
    "status": "Active",
    "release_date": "2023-01-11",
    "warranty_years": 2
  },
  {
    "sku": "RBX-COL-1007",
    "product_name": "CoBot Dual-Arm System",
    "category": "Collaborative Robots",
    "description": "The CoBot Dual-Arm System combines advanced force-torque sensing with 16 degrees of freedom across two synchronized robotic arms, enabling human-like dexterity for complex assembly and material handling tasks. Each arm features a 5kg payload capacity, integrated safety monitoring, and intuitive teach-pendant programming, allowing seamless collaboration between humans and robots in applications ranging from electronics assembly to small-parts handling. The system's compact 850mm reach per arm and ±0.02mm repeatability make it ideal for precise bench-top operations, while its built-in vision system and AI-powered path planning ensure consistent performance in dynamic manufacturing environments.",
    "msrp": 23932,
    "cost": 14359,
    "margin": 9573,
    "margin_pct": 40.0,
    "weight_kg": 63.15,
    "payload_capacity": "10 kg",
    "reach_mm": "1098 mm",
    "color_options": "Industrial Gray/Safety Yellow",
    "configurations_available": "Standard/Heavy Duty",
    "inventory_on_hand": 49,
    "inventory_location": "Minneapolis",
    "reorder_point": 10,
    "supplier": "Robotix Manufacturing",
    "lead_time_days": 38,
    "status": "Active",
    "release_date": "2021-03-08",
    "warranty_years": 2
  },
  {
    "sku": "RBX-MOB-1008",
    "product_name": "AutoNav AGV-500",
    "category": "Mobile Robots",
    "description": "The AutoNav AGV-500 is an advanced autonomous guided vehicle featuring dynamic path planning with LiDAR-based SLAM navigation, capable of handling payloads up to 500kg while maintaining precise positioning accuracy of ±5mm. Built with Robotix's industry-leading safety systems, including 360° obstacle detection and ISO/EN safety certification, this versatile AGV seamlessly integrates with existing warehouse management systems and excels in manufacturing environments, automated material handling, and cross-docking applications. The AGV-500's modular design supports multiple attachment options and its extended 12-hour battery life with opportunity charging ensures maximum uptime for 24/7 operations.",
    "msrp": 16922,
    "cost": 10153,
    "margin": 6769,
    "margin_pct": 40.0,
    "weight_kg": 172.64,
    "payload_capacity": "N/A",
    "reach_mm": "N/A",
    "color_options": "Industrial Gray/Safety Yellow",
    "configurations_available": "Standard/Heavy Duty",
    "inventory_on_hand": 34,
    "inventory_location": "Minneapolis",
    "reorder_point": 10,
    "supplier": "Vision Tech Ltd",
    "lead_time_days": 32,
    "status": "Active",
    "release_date": "2023-01-24",
    "warranty_years": 2
  },
  {
    "sku": "RBX-MOB-1009",
    "product_name": "SmartCart AMR-1000",
    "category": "Mobile Robots",
    "description": "The SmartCart AMR-1000 is an advanced autonomous mobile robot featuring dynamic path planning with 360° LiDAR sensing and a robust 1,000kg payload capacity, making it ideal for automated material transport in manufacturing and warehouse environments. Its industry-leading battery management system delivers up to 12 hours of continuous operation, while the intuitive fleet management software enables seamless integration with existing workflows and real-time monitoring across multiple units. The AMR-1000's collaborative safety features, including ISO/TS 15066 compliance and dynamic speed adaptation, allow for flexible deployment alongside human workers without the need for fixed barriers or designated zones.",
    "msrp": 18747,
    "cost": 11248,
    "margin": 7499,
    "margin_pct": 40.0,
    "weight_kg": 93.99,
    "payload_capacity": "N/A",
    "reach_mm": "N/A",
    "color_options": "Industrial Gray/Safety Yellow",
    "configurations_available": "Standard/Extended Reach",
    "inventory_on_hand": 29,
    "inventory_location": "Portland",
    "reorder_point": 10,
    "supplier": "Global Automation Components",
    "lead_time_days": 50,
    "status": "Active",
    "release_date": "2020-03-02",
    "warranty_years": 2
  },
  {
    "sku": "RBX-MOB-1010",
    "product_name": "PalletMover Robot",
    "category": "Mobile Robots",
    "description": "The PalletMover autonomous mobile robot combines advanced LiDAR navigation, omnidirectional movement, and a 3,300-pound payload capacity to revolutionize material handling in warehouses and manufacturing facilities. Its AI-powered fleet management system enables seamless multi-robot coordination while dynamic obstacle avoidance and EN ISO 13849-1 safety certification ensure reliable operation alongside human workers. The robot's intuitive touchscreen interface and cloud-based analytics help facilities achieve up to 30% improvement in logistics efficiency with typical ROI under 18 months.",
    "msrp": 28747,
    "cost": 17248,
    "margin": 11499,
    "margin_pct": 40.0,
    "weight_kg": 160.84,
    "payload_capacity": "N/A",
    "reach_mm": "N/A",
    "color_options": "Industrial Gray/Safety Yellow",
    "configurations_available": "Standard/Extended Reach",
    "inventory_on_hand": 29,
    "inventory_location": "Portland",
    "reorder_point": 10,
    "supplier": "Robotix Manufacturing",
    "lead_time_days": 59,
    "status": "Active",
    "release_date": "2024-09-06",
    "warranty_years": 2
  },
  {
    "sku": "RBX-MOB-1011",
    "product_name": "Inspection Rover",
    "category": "Mobile Robots",
    "description": "The Inspection Rover is a ruggedized autonomous mobile robot designed for comprehensive facility monitoring in hazardous or hard-to-reach environments, featuring advanced 3D LIDAR mapping, a 360° camera array, and IP65-rated environmental protection. Equipped with AI-powered anomaly detection and real-time data streaming capabilities, this versatile platform can operate continuously for up to 12 hours while navigating complex industrial spaces, making it ideal for oil & gas facilities, chemical plants, and large-scale manufacturing environments where regular infrastructure inspection is critical for safety and compliance.",
    "msrp": 23455,
    "cost": 14073,
    "margin": 9382,
    "margin_pct": 40.0,
    "weight_kg": 288.47,
    "payload_capacity": "N/A",
    "reach_mm": "N/A",
    "color_options": "Industrial Gray/Safety Yellow",
    "configurations_available": "Standard/Heavy Duty",
    "inventory_on_hand": 21,
    "inventory_location": "Portland",
    "reorder_point": 10,
    "supplier": "Robotix Manufacturing",
    "lead_time_days": 83,
    "status": "Active",
    "release_date": "2022-05-17",
    "warranty_years": 2
  },
  {
    "sku": "RBX-COM-1012",
    "product_name": "6-Axis Force Sensor",
    "category": "Components",
    "description": "The Robotix 6-Axis Force Sensor delivers industry-leading force and torque sensing across all axes (Fx, Fy, Fz, Tx, Ty, Tz) with exceptional precision up to 0.1N resolution and a measurement range of ±200N for force and ±20Nm for torque. Featuring built-in temperature compensation, industrial-grade IP67 protection, and EtherCAT real-time communication, this robust sensor enables precise force control in demanding applications like automated assembly, surface finishing, and human-robot collaboration. Its compact aluminum housing and standardized mounting pattern make it ideal for integration with collaborative robots and precision automation systems requiring reliable force feedback.",
    "msrp": 4577,
    "cost": 2746,
    "margin": 1831,
    "margin_pct": 40.0,
    "weight_kg": 5.38,
    "payload_capacity": "N/A",
    "reach_mm": "N/A",
    "color_options": "N/A",
    "configurations_available": "Standard/Heavy Duty",
    "inventory_on_hand": 20,
    "inventory_location": "Portland",
    "reorder_point": 10,
    "supplier": "Robotix Manufacturing",
    "lead_time_days": 38,
    "status": "Active",
    "release_date": "2022-05-15",
    "warranty_years": 1
  },
  {
    "sku": "RBX-COM-1013",
    "product_name": "High-Precision Gripper",
    "category": "Components",
    "description": "The Robotix High-Precision Gripper delivers industry-leading positional accuracy of ±0.02mm and adjustable gripping force from 10N to 200N, making it ideal for demanding semiconductor handling and precision assembly applications. Featuring integrated force-feedback sensors and quick-change finger modules, this IP65-rated gripper seamlessly interfaces with all major collaborative robot brands while its lightweight carbon fiber construction maximizes payload capacity. The gripper's advanced control algorithms enable both delicate handling of sensitive components and robust grip of heavier payloads up to 5kg, all in a compact 2.3kg package that's ready for 24/7 operation in automated manufacturing environments.",
    "msrp": 2687,
    "cost": 1612,
    "margin": 1075,
    "margin_pct": 40.0,
    "weight_kg": 5.33,
    "payload_capacity": "N/A",
    "reach_mm": "N/A",
    "color_options": "N/A",
    "configurations_available": "Single/Dual Arm",
    "inventory_on_hand": 21,
    "inventory_location": "Portland",
    "reorder_point": 10,
    "supplier": "Robotix Manufacturing",
    "lead_time_days": 21,
    "status": "Active",
    "release_date": "2024-11-19",
    "warranty_years": 1
  },
  {
    "sku": "RBX-COM-1014",
    "product_name": "Vision System Pro",
    "category": "Components",
    "description": "The Vision System Pro is a high-precision machine vision platform featuring dual 5MP stereoscopic cameras with integrated structured light projection, enabling accurate 3D object recognition and pose estimation at distances up to 2 meters. Powered by Robotix's advanced AI processing unit, this industrial-grade system delivers sub-millimeter accuracy for bin picking, assembly verification, and precision handling tasks, while its IP65-rated housing and modular mounting system ensure seamless integration with both collaborative and industrial robots. The system's intuitive teach pendant interface and pre-trained object recognition models significantly reduce setup time, making it ideal for flexible manufacturing environments requiring quick changeovers.",
    "msrp": 2111,
    "cost": 1266,
    "margin": 845,
    "margin_pct": 40.0,
    "weight_kg": 8.93,
    "payload_capacity": "N/A",
    "reach_mm": "N/A",
    "color_options": "N/A",
    "configurations_available": "Standard/Extended Reach",
    "inventory_on_hand": 25,
    "inventory_location": "Minneapolis",
    "reorder_point": 10,
    "supplier": "Global Automation Components",
    "lead_time_days": 18,
    "status": "Active",
    "release_date": "2020-02-22",
    "warranty_years": 1
  },
  {
    "sku": "RBX-COM-1015",
    "product_name": "End-Effector Kit",
    "category": "Components",
    "description": "The Robotix End-Effector Kit delivers precision-engineered mounting solutions for seamless integration of grippers, sensors, and custom tooling, featuring our proprietary quick-change system with <100μm repeatability and integrated power/signal pass-through. Designed for demanding industrial automation and collaborative robot applications, this modular kit includes aerospace-grade aluminum components, pre-configured mounting patterns for major gripper brands, and supports payloads up to 25kg while maintaining ISO/TS 15066 compliance for cobot installations.",
    "msrp": 3144,
    "cost": 1886,
    "margin": 1258,
    "margin_pct": 40.0,
    "weight_kg": 6.73,
    "payload_capacity": "N/A",
    "reach_mm": "N/A",
    "color_options": "N/A",
    "configurations_available": "Standard Only",
    "inventory_on_hand": 24,
    "inventory_location": "Minneapolis",
    "reorder_point": 10,
    "supplier": "Global Automation Components",
    "lead_time_days": 30,
    "status": "Active",
    "release_date": "2020-12-10",
    "warranty_years": 1
  },
  {
    "sku": "RBX-COM-1016",
    "product_name": "Safety Scanner System",
    "category": "Components",
    "description": "The Safety Scanner System from Robotix delivers industry-leading 275° detection coverage with configurable safety zones up to 5.5 meters, enabling seamless human-robot collaboration while maintaining the highest safety standards (PLe/SIL3). This advanced optoelectronic protective device features rapid 30ms response time, easy-to-program safety zones via intuitive software, and robust environmental resistance (IP65), making it ideal for automated guided vehicles (AGVs), collaborative robot cells, and flexible manufacturing environments where dynamic area protection is critical.",
    "msrp": 2494,
    "cost": 1496,
    "margin": 998,
    "margin_pct": 40.0,
    "weight_kg": 9.82,
    "payload_capacity": "N/A",
    "reach_mm": "N/A",
    "color_options": "N/A",
    "configurations_available": "Single/Dual Arm",
    "inventory_on_hand": 6,
    "inventory_location": "Portland",
    "reorder_point": 10,
    "supplier": "Global Automation Components",
    "lead_time_days": 36,
    "status": "Active",
    "release_date": "2020-05-10",
    "warranty_years": 1
  },
  {
    "sku": "RBX-SOF-1017",
    "product_name": "RobotOS Control Suite",
    "category": "Software",
    "description": "RobotOS Control Suite is an enterprise-grade robotics management platform that seamlessly integrates motion planning, real-time sensor fusion, and adaptive control algorithms for industrial automation systems. The suite features deterministic task scheduling with <1ms latency, native support for major industrial protocols including EtherCAT and PROFINET, and an intuitive drag-and-drop interface for programming complex multi-robot operations. Designed for both collaborative and heavy industrial applications, RobotOS enables rapid deployment of automated workflows while maintaining ISO/TS 15066 safety compliance and offering advanced fleet analytics for predictive maintenance.",
    "msrp": 1851,
    "cost": 555,
    "margin": 1296,
    "margin_pct": 70.0,
    "weight_kg": "N/A",
    "payload_capacity": "N/A",
    "reach_mm": "N/A",
    "color_options": "N/A",
    "configurations_available": "Single/Dual Arm",
    "inventory_on_hand": "Digital",
    "inventory_location": "N/A",
    "reorder_point": "N/A",
    "supplier": "Servo Systems Inc",
    "lead_time_days": 27,
    "status": "Active",
    "release_date": "2020-03-20",
    "warranty_years": 1
  },
  {
    "sku": "RBX-SOF-1018",
    "product_name": "Fleet Management Platform",
    "category": "Software",
    "description": "Robotix's comprehensive Fleet Management Platform seamlessly orchestrates multi-robot operations through an intuitive web-based interface, enabling real-time monitoring, predictive maintenance, and dynamic task allocation across your entire fleet of industrial and collaborative robots. The enterprise-grade software features advanced collision avoidance algorithms, customizable workflow automation, and detailed performance analytics, while its vendor-agnostic architecture supports integration with major robot brands and existing MES/WMS systems. Designed for manufacturing facilities and warehouses running complex automation scenarios, this platform optimizes robot utilization rates up to 40% while reducing deployment time by 60% through intelligent path planning and automated parameter configuration.",
    "msrp": 1872,
    "cost": 561,
    "margin": 1311,
    "margin_pct": 70.0,
    "weight_kg": "N/A",
    "payload_capacity": "N/A",
    "reach_mm": "N/A",
    "color_options": "N/A",
    "configurations_available": "Standard/Heavy Duty",
    "inventory_on_hand": "Digital",
    "inventory_location": "N/A",
    "reorder_point": "N/A",
    "supplier": "Robotix Manufacturing",
    "lead_time_days": 43,
    "status": "Active",
    "release_date": "2023-09-13",
    "warranty_years": 1
  },
  {
    "sku": "RBX-SOF-1019",
    "product_name": "Simulation & Programming Tool",
    "category": "Software",
    "description": "The Robotix Simulation & Programming Tool delivers enterprise-grade robot programming and digital twin capabilities, enabling seamless offline programming, real-time process optimization, and collision detection across our full range of collaborative and industrial robots. This comprehensive software suite features an intuitive drag-and-drop interface, advanced path planning algorithms, and native integration with major CAD platforms, while its physics-based simulation engine ensures precise replication of real-world conditions for maximum accuracy in cycle time calculations and reach studies. Ideal for system integrators and manufacturing engineers, the platform supports rapid deployment of complex automation cells and allows for risk-free validation of robotic applications including material handling, welding, and precision assembly.",
    "msrp": 1719,
    "cost": 515,
    "margin": 1204,
    "margin_pct": 70.0,
    "weight_kg": "N/A",
    "payload_capacity": "N/A",
    "reach_mm": "N/A",
    "color_options": "N/A",
    "configurations_available": "Standard Only",
    "inventory_on_hand": "Digital",
    "inventory_location": "N/A",
    "reorder_point": "N/A",
    "supplier": "Robotix Manufacturing",
    "lead_time_days": 43,
    "status": "Active",
    "release_date": "2022-10-20",
    "warranty_years": 1
  },
  {
    "sku": "RBX-SOF-1020",
    "product_name": "Predictive Maintenance AI",
    "category": "Software",
    "description": "Robotix's Predictive Maintenance AI leverages advanced machine learning algorithms and real-time sensor fusion to detect potential failures up to 3 weeks before they occur, analyzing vibration patterns, thermal signatures, and performance metrics across your entire robot fleet. This enterprise-grade solution seamlessly integrates with major industrial protocols (including EtherCAT and PROFINET) and features a customizable dashboard that provides actionable maintenance insights, helping manufacturers achieve up to 97% reduction in unplanned downtime. Designed specifically for industrial articulated robots and collaborative systems, the software's neural network has been trained on over 10 million hours of operational data from diverse manufacturing environments, making it particularly effective for automotive, electronics, and precision assembly applications.",
    "msrp": 734,
    "cost": 220,
    "margin": 514,
    "margin_pct": 70.0,
    "weight_kg": "N/A",
    "payload_capacity": "N/A",
    "reach_mm": "N/A",
    "color_options": "N/A",
    "configurations_available": "Single/Dual Arm",
    "inventory_on_hand": "Digital",
    "inventory_location": "N/A",
    "reorder_point": "N/A",
    "supplier": "Servo Systems Inc",
    "lead_time_days": 24,
    "status": "Active",
    "release_date": "2021-06-13",
    "warranty_years": 1
  }
]